geosmall/Arduino_Core_STM32/boards.txt
GenF4.name=Generic STM32F4 series

GenF4.build.core=arduino
GenF4.build.board=GenF4
GenF4.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF4.build.mcu=cortex-m4
GenF4.build.fpu=-mfpu=fpv4-sp-d16
GenF4.build.float-abi=-mfloat-abi=hard
GenF4.build.series=STM32F4xx
GenF4.build.flash_offset=0x0
GenF4.upload.maximum_size=0
GenF4.upload.maximum_data_size=0

# Upload menu
GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF4.menu.upload_method.swdMethod.upload.protocol=0
GenF4.menu.upload_method.swdMethod.upload.options=
GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF4.menu.upload_method.serialMethod.upload.protocol=1
GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF4.menu.upload_method.dfuMethod.upload.protocol=2
GenF4.menu.upload_method.dfuMethod.upload.options=
GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenF4.menu.upload_method.jlinkMethod.upload.protocol=3
GenF4.menu.upload_method.jlinkMethod.upload.options=
GenF4.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID

GenF4.menu.upload_method.clipboard=Clipboard (Copy Path)
GenF4.menu.upload_method.clipboard.upload.protocol=0
GenF4.menu.upload_method.clipboard.upload.options=-g
GenF4.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Generic STM32F7 series

GenF7.name=Generic STM32F7 series

GenF7.build.core=arduino
GenF7.build.board=GenF7
GenF7.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF7.build.mcu=cortex-m7
GenF7.build.fpu=-mfpu=fpv4-sp-d16
GenF7.build.float-abi=-mfloat-abi=hard
GenF7.build.series=STM32F7xx
GenF7.build.flash_offset=0x0
GenF7.upload.maximum_size=0
GenF7.upload.maximum_data_size=0

# Upload menu
GenF7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF7.menu.upload_method.swdMethod.upload.protocol=0
GenF7.menu.upload_method.swdMethod.upload.options=
GenF7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF7.menu.upload_method.serialMethod.upload.protocol=1
GenF7.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF7.menu.upload_method.dfuMethod.upload.protocol=2
GenF7.menu.upload_method.dfuMethod.upload.options=
GenF7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenF7.menu.upload_method.jlinkMethod.upload.protocol=3
GenF7.menu.upload_method.jlinkMethod.upload.options=
GenF7.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.clipboard=Clipboard (Copy Path)
GenF7.menu.upload_method.clipboard.upload.protocol=0
GenF7.menu.upload_method.clipboard.upload.options=-g
GenF7.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Generic STM32G4 series

GenG4.name=Generic STM32G4 series

GenG4.build.core=arduino
GenG4.build.board=GenG4
GenG4.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenG4.build.mcu=cortex-m4
GenG4.build.fpu=-mfpu=fpv4-sp-d16
GenG4.build.float-abi=-mfloat-abi=hard
GenG4.build.series=STM32G4xx
GenG4.build.flash_offset=0x0
GenG4.build.uf2_flash_offset=0x0
GenG4.upload.maximum_size=0
GenG4.upload.maximum_data_size=0

# Upload menu
GenG4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG4.menu.upload_method.swdMethod.upload.protocol=0
GenG4.menu.upload_method.swdMethod.upload.options=
GenG4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG4.menu.upload_method.serialMethod.upload.protocol=1
GenG4.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenG4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG4.menu.upload_method.dfuMethod.upload.protocol=2
GenG4.menu.upload_method.dfuMethod.upload.options=
GenG4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenG4.menu.upload_method.jlinkMethod.upload.protocol=3
GenG4.menu.upload_method.jlinkMethod.upload.options=
GenG4.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.bootuf2Method=UF2 Bootloader
GenG4.menu.upload_method.bootuf2Method.upload.protocol=uf2
GenG4.menu.upload_method.bootuf2Method.upload.tool=uf2_upload
GenG4.menu.upload_method.bootuf2Method.build.flash_offset={build.uf2_flash_offset}
GenG4.menu.upload_method.bootuf2Method.build.bootloader_flags=-DBL_BOOTUF2

GenG4.menu.upload_method.clipboard=Clipboard (Copy Path)
GenG4.menu.upload_method.clipboard.upload.protocol=0
GenG4.menu.upload_method.clipboard.upload.options=-g
GenG4.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Generic STM32H7 Series

GenH7.name=Generic STM32H7 Series

GenH7.build.core=arduino
GenH7.build.board=GenH7
GenH7.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial}
GenH7.build.fpu=-mfpu=fpv4-sp-d16
GenH7.build.float-abi=-mfloat-abi=hard
GenH7.build.series=STM32H7xx
GenH7.build.mcu=cortex-m7
GenH7.build.flash_offset=0x0
GenH7.upload.maximum_size=0
GenH7.upload.maximum_data_size=0

# Upload menu
GenH7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH7.menu.upload_method.swdMethod.upload.protocol=0
GenH7.menu.upload_method.swdMethod.upload.options=
GenH7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenH7.menu.upload_method.serialMethod.upload.protocol=1
GenH7.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenH7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenH7.menu.upload_method.dfuMethod.upload.protocol=2
GenH7.menu.upload_method.dfuMethod.upload.options=
GenH7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenH7.menu.upload_method.jlinkMethod.upload.protocol=3
GenH7.menu.upload_method.jlinkMethod.upload.options=
GenH7.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

